#### Terraform Plan (Prod) 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
data.google_project.project: Reading...
google_project_service.secretmanager_api: Refreshing state... [id=calendarsync-napier/secretmanager.googleapis.com]
google_project_service.artifact_registry_api: Refreshing state... [id=calendarsync-napier/artifactregistry.googleapis.com]
data.google_iam_policy.noauth: Reading...
google_project_service.cloudbuild_api: Refreshing state... [id=calendarsync-napier/cloudbuild.googleapis.com]
google_project_service.serviceusage_api: Refreshing state... [id=calendarsync-napier/serviceusage.googleapis.com]
google_service_account.github_actions: Refreshing state... [id=projects/calendarsync-napier/serviceAccounts/github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_service.iamcredentials_api: Refreshing state... [id=calendarsync-napier/iamcredentials.googleapis.com]
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_project_service.cloudresourcemanager_api: Refreshing state... [id=calendarsync-napier/cloudresourcemanager.googleapis.com]
google_project_service.run_api: Refreshing state... [id=calendarsync-napier/run.googleapis.com]
google_project_service.iam_api: Refreshing state... [id=calendarsync-napier/iam.googleapis.com]
google_project_service.firestore_api: Refreshing state... [id=calendarsync-napier/firestore.googleapis.com]
google_iam_workload_identity_pool.github_pool: Refreshing state... [id=projects/calendarsync-napier/locations/global/workloadIdentityPools/github-pool]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_project_service.calendar_api will be created
  + resource "google_project_service" "calendar_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "calendar-json.googleapis.com"
    }

  # google_project_service.cloudscheduler_api will be created
  + resource "google_project_service" "cloudscheduler_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "cloudscheduler.googleapis.com"
    }

  # google_service_account.scheduler_invoker will be created
  + resource "google_service_account" "scheduler_invoker" {
      + account_id   = "scheduler-invoker"
      + disabled     = false
      + display_name = "Cloud Scheduler Invoker"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @billnapier, Action: `pull_request`*